In [2]:
#convert list into dictionary
fruits=["Orange","Apple","banana"]
Genere=["orange","Red","Yellow"]
dict(zip(fruits,Genere))

{'Orange': 'orange', 'Apple': 'Red', 'banana': 'Yellow'}

In [3]:
a=['Occupy','Lakers','Clippers']
b=[2,5,6]
list(zip(a,b))

[('Occupy', 2), ('Lakers', 5), ('Clippers', 6)]

In [5]:
#Use zip and zip(*list)
car=["Audi","BMW","Scoobydrive"]
bike=["motor","scooter","scooty"]
zipped = list(zip(car,bike))
print(zipped)
print(*zipped)

[('Audi', 'motor'), ('BMW', 'scooter'), ('Scoobydrive', 'scooty')]
('Audi', 'motor') ('BMW', 'scooter') ('Scoobydrive', 'scooty')

In [7]:
#flatted a list
f=[[1,2],[5,6],[3,4]]
sum(f,[])
sorted(sum(f,[]))

[1, 2, 3, 4, 5, 6]

In [9]:
import pickle
pickle.dump(model, open(model_file_path, 'wb'))
model=pickle.load(open(model_file_path, 'rb'))

NameError: name 'model' is not defined

In [19]:
import pandas as pd
df1 = pd.DataFrame({'Name':['Souvik','Somesh','Fickle','Alex','Tom'],
                   'Subject':['Science','Commerce','Arts','General','Pol-Science'],
                    'grade':['B+','C','A+','A','B'],
                   'Age':[16,18,34,45,56]})
df1

     Name      Subject grade  Age
0  Souvik      Science    B+   16
1  Somesh     Commerce     C   18
2  Fickle         Arts    A+   34
3    Alex      General     A   45
4     Tom  Pol-Science     B   56

In [22]:
#use melt
df1 = df1.melt(id_vars=['Name','Age'],var_name='Subject1',value_name='Asses')
df1

     Name  Age Subject1        Asses
0  Souvik   16  Subject      Science
1  Somesh   18  Subject     Commerce
2  Fickle   34  Subject         Arts
3    Alex   45  Subject      General
4     Tom   56  Subject  Pol-Science
5  Souvik   16    grade           B+
6  Somesh   18    grade            C
7  Fickle   34    grade           A+
8    Alex   45    grade            A
9     Tom   56    grade            B

In [23]:
df1.T

,0,1,2,3,4,5,6,7,8,9
Name,Souvik,Somesh,Fickle,Alex,Tom,Souvik,Somesh,Fickle,Alex,Tom
Age,16,18,34,45,56,16,18,34,45,56
Subject1,Subject,Subject,Subject,Subject,Subject,grade,grade,grade,grade,grade
Asses,Science,Commerce,Arts,General,Pol-Science,B+,C,A+,A,B

In [25]:
import pandas as pd
import numpy as np
df2 = pd.DataFrame({'city':['SunnyVale','Alto-Sanchaz','Pondicherry'],
                   'day1':[73,80,70],
                   'day2':[80,75,65],
                   'day3':[88,76,60]})
df2

           city  day1  day2  day3
0     SunnyVale    73    80    88
1  Alto-Sanchaz    80    75    76
2   Pondicherry    70    65    60

In [26]:
df2.melt(id_vars=['city'])

           city variable  value
0     SunnyVale     day1     73
1  Alto-Sanchaz     day1     80
2   Pondicherry     day1     70
3     SunnyVale     day2     80
4  Alto-Sanchaz     day2     75
5   Pondicherry     day2     65
6     SunnyVale     day3     88
7  Alto-Sanchaz     day3     76
8   Pondicherry     day3     60

In [29]:
from faker import Faker
fake = Faker()
name=fake.name()
print(name)
address=fake.address()
print(address)
text=fake.text()
print(text)

ModuleNotFoundError: No module named 'faker'

In [30]:
dir(fake)

NameError: name 'fake' is not defined

In [32]:
import pandas as pd
df=pd.DataFrame({'Location':['Cupertino,California','Los Angles','California','Palo Alto','California']})
df[['City','State']]=df.Location.str.split(',',expand=True)
df

               Location        City       State
0  Cupertino,California   Cupertino  California
1            Los Angles  Los Angles        None
2            California  California        None
3             Palo Alto   Palo Alto        None
4            California  California        None

In [33]:
string="You are the super Hero"
print(string.lower())
print(string.upper())
print(string.swapcase())

you are the super hero
YOU ARE THE SUPER HERO
yOU ARE THE SUPER hERO

In [35]:
x=5
y=10
x, y=y, x
print(x)
print(y)

10
5

In [37]:
a={'apple':1}
b={'orange':2,'apple':2,'banana':4}

{**a, **b}

{'apple': 2, 'orange': 2, 'banana': 4}

In [38]:
from tqdm import tqdm

for i in tqdm(range(100000)):
    pass

100%|██████████████████████████████| 100000/100000 [00:00<00:00, 2693698.46it/s]

In [39]:
c1 = ['apple','oranges','bananas']
c1=c1+['grapes']
c1

['apple', 'oranges', 'bananas', 'grapes']

In [41]:
l1 = [10,20,30,40,50,60,70,80]
l1[2:4]=[43,56]
l1

[10, 20, 43, 56, 50, 60, 70, 80]

In [43]:
import os
os.getcwd()
os.path.abspath('gold.csv')
fp="/Users/souvikpatra/Downloads/gold.csv"
os.path.isdir(fp)
os.path.isfile(fp)
os.path.ismount(fp)

False